Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
block1_conv1 (Conv2D)           (None, 224, 224, 64) 1792        input_1[0][0]                    
__________________________________________________________________________________________________
block1_conv2 (Conv2D)           (None, 224, 224, 64) 36928       block1_conv1[0][0]               
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)      (None, 112, 112, 64) 0           block1_conv2[0][0]               
__________________________________________________________________________________________________
block2_conv1 (Conv2D)           (None, 112, 112, 128 73856       block1_pool[0][0]                
__________________________________________________________________________________________________
block2_conv2 (Conv2D)           (None, 112, 112, 128 147584      block2_conv1[0][0]               
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)      (None, 56, 56, 128)  0           block2_conv2[0][0]               
__________________________________________________________________________________________________
block3_conv1 (Conv2D)           (None, 56, 56, 256)  295168      block2_pool[0][0]                
__________________________________________________________________________________________________
block3_conv2 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv1[0][0]               
__________________________________________________________________________________________________
block3_conv3 (Conv2D)           (None, 56, 56, 256)  590080      block3_conv2[0][0]               
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)      (None, 28, 28, 256)  0           block3_conv3[0][0]               
__________________________________________________________________________________________________
block4_conv1 (Conv2D)           (None, 28, 28, 512)  1180160     block3_pool[0][0]                
__________________________________________________________________________________________________
block4_conv2 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv1[0][0]               
__________________________________________________________________________________________________
block4_conv3 (Conv2D)           (None, 28, 28, 512)  2359808     block4_conv2[0][0]               
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)      (None, 14, 14, 512)  0           block4_conv3[0][0]               
__________________________________________________________________________________________________
block5_conv1 (Conv2D)           (None, 14, 14, 512)  2359808     block4_pool[0][0]                
__________________________________________________________________________________________________
block5_conv2 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv1[0][0]               
__________________________________________________________________________________________________
block5_conv3 (Conv2D)           (None, 14, 14, 512)  2359808     block5_conv2[0][0]               
__________________________________________________________________________________________________
block5_pool (MaxPooling2D)      (None, 7, 7, 512)    0           block5_conv3[0][0]               
__________________________________________________________________________________________________
vgg16_block_1to5_flat (Flatten) (None, 25088)        0           block5_pool[0][0]                
__________________________________________________________________________________________________
loc_dense1 (Dense)              (None, 2048)         51382272    vgg16_block_1to5_flat[0][0]      
__________________________________________________________________________________________________
loc_dense2 (Dense)              (None, 1024)         2098176     loc_dense1[0][0]                 
__________________________________________________________________________________________________
class_dense1 (Dense)            (None, 256)          6422784     vgg16_block_1to5_flat[0][0]      
__________________________________________________________________________________________________
loc_dropout1 (Dropout)          (None, 1024)         0           loc_dense2[0][0]                 
__________________________________________________________________________________________________
class_dropout2 (Dropout)        (None, 256)          0           class_dense1[0][0]               
__________________________________________________________________________________________________
loc_dense4 (Dense)              (None, 512)          524800      loc_dropout1[0][0]               
__________________________________________________________________________________________________
class_dense2 (Dense)            (None, 128)          32896       class_dropout2[0][0]             
__________________________________________________________________________________________________
loc_dense5 (Dense)              (None, 128)          65664       loc_dense4[0][0]                 
__________________________________________________________________________________________________
class_dense3 (Dense)            (None, 3)            387         class_dense2[0][0]               
__________________________________________________________________________________________________
loc_dense6 (Dense)              (None, 4)            516         loc_dense5[0][0]                 
==================================================================================================
Total params: 75,242,183
Trainable params: 60,527,495
Non-trainable params: 14,714,688
__________________________________________________________________________________________________
